#子查询练习
# 1、查询工资最低的员工信息:last_name, salary
# 2、查询平均工资最低的部门信息
# 3、查询平均工资最低的部门信息和该部门的平均工资
# 4、查询平均工资最高的 job 信息
# 5、查询平均工资高于公司平均工资的部门有哪些？
# 6、查询出公司中所有 manager 的详细信息
# 7、各个部门中，最高工资中最低的那个部门的 最低工资是多少
# 8、查询平均工资最高的部门的 manager 的详细信息：last_Name, department_id, email, salary

#练习
#1. 查询和 Zlotkey 相同部门的员工姓名和工资
#2. 查询工资比公司平均工资高的员工的员工号
#3. 查询各部门中工资比本部门平均工资高的员工的员工号、姓名和工资
#4. 查询和姓名中包含字母 u 的员工在相同部门的员工的员工号和姓名
#5. 查询在部门的 location_id 为 1700 的部门工作的员工和员工号
#6. 查询管理者是 King 的员工姓名和工资
#7. 查询工资最高的员工的姓名，要求 first_name 和 last_name 显示为一列，列名为 姓.名